<a href="https://colab.research.google.com/github/Dibyas83/ML/blob/main/Working_withcsvtsv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

opening local csv file- will be opened as a dataframe

In [ ]:
df = pd.read_csv('house-price-parquet.csv')

from a server

In [ ]:
pip install kagglehub

Collecting kagglehub
  Downloading kagglehub-0.3.13-py3-none-any.whl.metadata (38 kB)
Requirement already satisfied: packaging in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from kagglehub) (25.0)
Requirement already satisfied: pyyaml in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from kagglehub) (6.0.2)
Requirement already satisfied: requests in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from kagglehub) (2.32.4)
Collecting tqdm (from kagglehub)
  Using cached tqdm-4.67.1-py3-none-any.whl.metadata (57 kB)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from requests->kagglehub) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from requests->kagglehub) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from requests->kagglehub) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from requests->kagglehub) (2025.10.5)
Requirement already satisfied: colorama in c:\users\lenovo\anaconda3\envs\100days.env\lib\site-packages (from tqdm->kagglehub) (0.4.6)
Downloading kagglehub-0.3.13-py3-none-any.whl (68 kB)
Using cached tqdm-4.67.1-py3-none-any.whl (78 kB)
Installing collected packages: tqdm, kagglehub

   ---------------------------------------- 0/2 [tqdm]
   -------------------- ------------------- 1/2 [kagglehub]
   ---------------------------------------- 2/2 [kagglehub]

Successfully installed kagglehub-0.3.13 tqdm-4.67.1
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("tejashvi14/engineering-placements-prediction")

print("Path to dataset files:", path)

Downloading from https://www.kaggle.com/api/v1/datasets/download/tejashvi14/engineering-placements-prediction?dataset_version_number=6...

100%|██████████| 10.0k/10.0k [00:00<00:00, 5.50MB/s]

Extracting files...
Path to dataset files: C:\Users\lenovo\.cache\kagglehub\datasets\tejashvi14\engineering-placements-prediction\versions\6

from github  - copy raw address link

In [ ]:
    github_csv_url = "https://github.com/Dibyas83/ML/raw/refs/heads/main/titanic-parquet.csv"
    df = pd.read_csv(github_csv_url)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,\N,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,\N,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,\N,S
5,6,0,3,"Moran, Mr. James",male,\N,0,0,330877,8.4583,\N,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,\N,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,\N,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,\N,C

In [ ]:
import requests
from io import StringIO

url = "https://github.com/Dibyas83/ML/raw/refs/heads/main/titanic-parquet.csv"
headers = {"User-Agent": "Mozilla/5.0; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url, headers=headers)
data = StringIO(req.text)
pd.read_csv(data)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,\N,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,\N,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,\N,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,\N,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,\N,1,2,W./C. 6607,23.4500,\N,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,\N,Q

separator

In [ ]:
pd.read_csv("house-price.tsv", sep = "\t")

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

if no col name,we can give list of names as sometimes first row is given as name
pd.read_csv("house-price.tsv", sep = "\t",names = [id,pr,rt,roooms,.......])

sometime we can convert  a col with unique data into id- pd.read_csv("house-price.tsv",index_col= "enrol_id")

In [ ]:
pd.read_csv('house-price-parquet.csv')

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [ ]:
pd.read_csv('house-price-parquet.csv',index_col= "price")

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
price,,,,,,,,,,,,
13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...
1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [ ]:
pd.read_csv('house-price-parquet.csv',index_col= 1) # based on area

,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
price,,,,,,,,,,,,
13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...
1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

Header Parameter

sometimes the header row is given as 0 row and jupyter doesnt understand it as names
pd.read_csv('house-price-parquet.csv', header=1)

Use cols parameter
sometimes we want specific cols in dataframe

In [ ]:
df2 = pd.read_csv('house-price-parquet.csv',usecols= ['bathrooms',	'stories',	"mainroad"])

In [ ]:
df2.head(10)

   bathrooms  stories mainroad
0          2        3      yes
1          4        4      yes
2          2        2      yes
3          2        2      yes
4          1        2      yes
5          3        1      yes
6          3        4      yes
7          3        2      yes
8          1        2      yes
9          2        4      yes

squeze parameters - to create a pandas series instead of df
df = pd.read_csv('your_file.csv')

# If the DataFrame has only one column, convert it to a Series
if len(df.columns) == 1:
    series = df.squeeze('columns') # or simply df.squeeze() if you want to squeeze all length-1 axes
else:
    series = None # or handle the case where it's not a single column DataFrame

# Now you can work with 'series' if it was a single-column file, otherwise 'df' is your DataFrame.
print(series

In [ ]:
df_single_col = pd.DataFrame({'A': [10, 20, 30]})
s_from_df = df_single_col.squeeze()
print("DataFrame with single column:\n", df_single_col)
print("\nSqueezed to Series:\n", s_from_df)

DataFrame with single column:
     A
0  10
1  20
2  30

Squeezed to Series:
 0    10
1    20
2    30
Name: A, dtype: int64

skip rows

In [ ]:
df2 = pd.read_csv('house-price-parquet.csv',skiprows=[1,3])

In [ ]:
df2.head(10)

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
1,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
2,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
3,10850000,7500,3,3,1,yes,no,yes,no,yes,2,yes,semi-furnished
4,10150000,8580,4,3,4,yes,no,no,no,yes,2,yes,semi-furnished
5,10150000,16200,5,3,2,yes,no,no,no,no,0,no,unfurnished
6,9870000,8100,4,1,2,yes,yes,yes,no,yes,2,yes,furnished
7,9800000,5750,3,2,4,yes,yes,no,no,yes,1,yes,unfurnished
8,9800000,13200,3,1,2,yes,no,yes,no,yes,2,yes,furnished
9,9681000,6000,4,3,2,yes,yes,yes,yes,no,2,no,semi-furnished

In [ ]:
df2 = df2[df2.index % 5 != 0]

In [ ]:
df2.head(10)

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
1,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
2,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
3,10850000,7500,3,3,1,yes,no,yes,no,yes,2,yes,semi-furnished
4,10150000,8580,4,3,4,yes,no,no,no,yes,2,yes,semi-furnished
6,9870000,8100,4,1,2,yes,yes,yes,no,yes,2,yes,furnished
7,9800000,5750,3,2,4,yes,yes,no,no,yes,1,yes,unfurnished
8,9800000,13200,3,1,2,yes,no,yes,no,yes,2,yes,furnished
9,9681000,6000,4,3,2,yes,yes,yes,yes,no,2,no,semi-furnished
11,9240000,3500,4,2,2,yes,no,no,yes,no,2,no,furnished
12,9240000,7800,3,2,2,yes,no,no,no,no,0,yes,semi-furnished

In [ ]:
#df2 = pd.read_csv('house-price-parquet.csv',skiprows=[lambda x: x % 5 != 0])
rows_to_keep = df2.index[((df2.index + 1) % 5 != 0)] # df.index: This accesses the default integer index of the DataFrame (0, 1, 2, ...)

In [ ]:
df_filtered = df.iloc[rows_to_keep]

print("\nDataFrame after skipping rows where row number is divisible by 5:")
print(df_filtered)

DataFrame after skipping rows where row number is divisible by 5:
     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
6              7         0       1
7              8         0       3
..           ...       ...     ...
536          537         0       1
537          538         1       1
538          539         0       3
541          542         0       3
542          543         0       3

                                                  Name     Sex Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38      1
2                               Heikkinen, Miss. Laina  female  26      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35      1
6                              McCarthy, Mr. Timothy J    male  54      0
7                       Palsson, Master. Gosta Leonard    male   2      3
..                                                 ...     ...  ..    ...
536                  Butt, Major. Archibald Willingham    male  45      0
537                                LeRoy, Miss. Bertha  female  30      0
538                           Risien, Mr. Samuel Beard    male  \N      0
541               Andersson, Miss. Ingeborg Constanzia  female   9      4
542                  Andersson, Miss. Sigrid Elisabeth  female  11      4

     Parch            Ticket      Fare Cabin Embarked
1        0          PC 17599   71.2833   C85        C
2        0  STON/O2. 3101282    7.9250    \N        S
3        0            113803   53.1000  C123        S
6        0             17463   51.8625   E46        S
7        1            349909   21.0750    \N        S
..     ...               ...       ...   ...      ...
536      0            113050   26.5500   B38        S
537      0          PC 17761  106.4250    \N        C
538      0            364498   14.5000    \N        S
541      2            347082   31.2750    \N        S
542      2            347082   31.2750    \N        S

[326 rows x 12 columns]

n rows if 100 only 100 rows will come

In [ ]:
pd.read_csv('house-price-parquet.csv',nrows = 100)

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,6300000,4100,3,2,3,yes,no,no,no,yes,2,no,semi-furnished
96,6300000,9000,3,1,1,yes,no,yes,no,no,1,yes,furnished
97,6300000,6400,3,1,1,yes,yes,yes,no,yes,1,yes,semi-furnished
98,6293000,6600,3,2,3,yes,no,no,no,yes,0,yes,unfurnished
99,6265000,6000,4,1,3,yes,yes,yes,no,no,0,yes,unfurnished

Encoding Parameter - if encoding is not default utf8 ex zomato data is not utf8,change the texts encoding in texteditor like sublime text or find how it is encoded and pass it when reading the csv
pd.read_csv('zomato.csv', encoding='latin-1')

skip bad lines - if some rows have more data than col, or wrong data types in between ---to skip those rows

In [ ]:
pd.read_csv('house-price-parquet.csv',sep=';',encoding='latin-1', on_bad_lines='skip')

    price,"area","bedrooms","bathrooms","stories","mainroad","guestroom","basement","hotwaterheating","airconditioning","parking","prefarea","furnishingstatus"
0    13300000,7420,4,2,3,"yes","no","no","no","yes"...
1    12250000,8960,4,4,4,"yes","no","no","no","yes"...
2    12250000,9960,3,2,2,"yes","no","yes","no","no"...
3    12215000,7500,4,2,2,"yes","no","yes","no","yes...
4    11410000,7420,4,1,2,"yes","yes","yes","no","ye...
..                                                 ...
540  1820000,3000,2,1,1,"yes","no","yes","no","no",...
541  1767150,2400,3,1,1,"no","no","no","no","no",0,...
542  1750000,3620,2,1,1,"yes","no","no","no","no",0...
543  1750000,2910,3,1,1,"no","no","no","no","no",0,...
544  1750000,3850,3,1,2,"yes","no","no","no","no",0...

[545 rows x 1 columns]

dtypes parameter - panda can find data type while reading csv.ex if 0,1 in a col is made float ,it can be  int taking smaller space

In [ ]:
pd.read_csv('house-price-parquet.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              545 non-null    int64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          545 non-null    object
 6   guestroom         545 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   545 non-null    object
 9   airconditioning   545 non-null    object
 10  parking           545 non-null    int64
 11  prefarea          545 non-null    object
 12  furnishingstatus  545 non-null    object
dtypes: int64(6), object(7)
memory usage: 55.5+ KB

pd.read_csv('house-price-parquet.csv',dtype={'area': int}) # if area was diff it would change

by default date is passed as string or object, we need to keep it in datetime

In [ ]:
pd.read_csv('business-financial-data-march-2025-quarter-csv.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8595 entries, 0 to 8594
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  8595 non-null   object
 1   Period            8595 non-null   float64
 2   Data_value        8550 non-null   float64
 3   Suppressed        15 non-null     object
 4   STATUS            8595 non-null   object
 5   UNITS             8595 non-null   object
 6   Magnitude         8595 non-null   int64
 7   Subject           8595 non-null   object
 8   Group             8595 non-null   object
 9   Series_title_1    8595 non-null   object
 10  Series_title_2    8595 non-null   object
 11  Series_title_3    8595 non-null   object
 12  Series_title_4    8595 non-null   object
 13  Series_title_5    0 non-null      float64
dtypes: float64(3), int64(1), object(10)
memory usage: 940.2+ KB

In [ ]:
pd.read_csv('business-financial-data-march-2025-quarter-csv.csv',parse_dates=['Period'])

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10760\3023233688.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.read_csv('business-financial-data-march-2025-quarter-csv.csv',parse_dates=['Period'])

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SF1AA2CA,2016-06-01,1116.386,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
1,BDCQ.SF1AA2CA,2016-09-01,1070.874,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
2,BDCQ.SF1AA2CA,2016-12-01,1054.408,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
3,BDCQ.SF1AA2CA,2017-03-01,1010.665,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
4,BDCQ.SF1AA2CA,2017-06-01,1233.700,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8590,BDCQ.SF8RSCA,2024-03-01,631.229,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8591,BDCQ.SF8RSCA,2024-06-01,542.409,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8592,BDCQ.SF8RSCA,2024-09-01,612.190,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8593,BDCQ.SF8RSCA,2024-12-01,643.976,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
8594,BDCQ.SF8RSCA,2025-03-01,699.681,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN

In [ ]:
pd.read_csv('business-financial-data-march-2025-quarter-csv.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8595 entries, 0 to 8594
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  8595 non-null   object
 1   Period            8595 non-null   float64
 2   Data_value        8550 non-null   float64
 3   Suppressed        15 non-null     object
 4   STATUS            8595 non-null   object
 5   UNITS             8595 non-null   object
 6   Magnitude         8595 non-null   int64
 7   Subject           8595 non-null   object
 8   Group             8595 non-null   object
 9   Series_title_1    8595 non-null   object
 10  Series_title_2    8595 non-null   object
 11  Series_title_3    8595 non-null   object
 12  Series_title_4    8595 non-null   object
 13  Series_title_5    0 non-null      float64
dtypes: float64(3), int64(1), object(10)
memory usage: 940.2+ KB

if data month year are given in diff col

In [ ]:


df5 = pd.DataFrame({
    'FirstName': ['John', 'Jane'],
    'LastName': ['Smith', 'Doe'],
    'City': ['New York', 'Los Angeles']
})

# Combine FirstName and LastName into a 'FullName' column with a space separator
df5['FullName'] = df5['FirstName'] + ' ' + df5['LastName']

# Combine all three columns into an 'Address' column with comma and space separators
df5['Address'] = df5['FullName'] + ', ' + df5['City']

print(df5)

  FirstName LastName         City    FullName                Address
0      John    Smith     New York  John Smith   John Smith, New York
1      Jane      Doe  Los Angeles    Jane Doe  Jane Doe, Los Angeles

In [ ]:

df6 = pd.DataFrame({
    'First': ['Ganesh', 'Sartaj'],
    'Last': ['Gaitonde', 'Singh']
})

# Combine 'First' and 'Last' into 'Name' with a space separator
df6['Name'] = df6['First'].str.cat(df6['Last'], sep=' ')

print(df6)

    First      Last             Name
0  Ganesh  Gaitonde  Ganesh Gaitonde
1  Sartaj     Singh     Sartaj Singh

In [ ]:
df7 = pd.DataFrame({
    'Salary': [50000, 60000],
    'Bonus': [5000, 7000]
})

# Calculate 'TotalCompensation' by adding 'Salary' and 'Bonus'
df7['TotalCompensation'] = df7['Salary'] + df7['Bonus']

print(df7)

   Salary  Bonus  TotalCompensation
0   50000   5000              55000
1   60000   7000              67000

In [ ]:
df8 = pd.DataFrame({
    'Date': ['2023-01-01', '2023-01-02'],
    'Time': ['10:00:00', '11:30:00'],
    'Event': ['Meeting', 'Presentation']
})

# Combine 'Date' and 'Time' into a 'DateTime' column and convert to datetime objects
df8['DateTime'] = df8.apply(lambda row: pd.to_datetime(row['Date'] + ' ' + row['Time']), axis=1)

# Combine 'Event' and 'DateTime' into a 'Log' string
df8['Log'] = df8.apply(lambda row: f"{row['DateTime']} - {row['Event']}", axis=1)

print(df8)

         Date      Time         Event            DateTime  \
0  2023-01-01  10:00:00       Meeting 2023-01-01 10:00:00
1  2023-01-02  11:30:00  Presentation 2023-01-02 11:30:00

                                  Log
0       2023-01-01 10:00:00 - Meeting
1  2023-01-02 11:30:00 - Presentation

Converter - for transformation over cols

In [ ]:
pd.read_csv('Sold Player.csv',encoding='ansi')

,Sr. No.,Player,Teams,Base Price,Winning Bids,Capped / Uncapped
0,1,Noor Ahmad,Chennai Super Kings,"2,00,00,000","10,00,00,000",Capped
1,2,Ravichandaran Ashwin,Chennai Super Kings,"2,00,00,000","9,75,00,000",Capped
2,3,Devon Conway,Chennai Super Kings,"2,00,00,000","6,25,00,000",Capped
3,4,Syed Khaleel Ahmed,Chennai Super Kings,"2,00,00,000","4,80,00,000",Capped
4,5,Rachin Ravindra,Chennai Super Kings,"1,50,00,000","4,00,00,000",Capped
...,...,...,...,...,...,...
177,178,Kamindu Mendis,Sunrisers Hyderabad,"75,00,000","75,00,000",Capped
178,179,Zeeshan Ansari,Sunrisers Hyderabad,"30,00,000","40,00,000",Uncapped
179,180,Sachin Baby,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped
180,181,Aniket Verma,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped
181,182,Atharva Taide,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped

In [ ]:
def rename(name):
    if name == "Sunrisers Hyderabad":
        return 'SH'
    else:
        return name

In [ ]:
rename("Sunrisers Hyderabad")

'SH'

pd.read_csv('Sold Player.csv',encoding='ansi',converters={'Teams':rename})

if no value is there nor nan but '-'.so we decide what type of values can be considered nan

In [ ]:
pd.read_csv('Sold Player.csv',encoding='ansi',na_values = ['-','male'])

,Sr. No.,Player,Teams,Base Price,Winning Bids,Capped / Uncapped
0,1,Noor Ahmad,Chennai Super Kings,"2,00,00,000","10,00,00,000",Capped
1,2,Ravichandaran Ashwin,Chennai Super Kings,"2,00,00,000","9,75,00,000",Capped
2,3,Devon Conway,Chennai Super Kings,"2,00,00,000","6,25,00,000",Capped
3,4,Syed Khaleel Ahmed,Chennai Super Kings,"2,00,00,000","4,80,00,000",Capped
4,5,Rachin Ravindra,Chennai Super Kings,"1,50,00,000","4,00,00,000",Capped
...,...,...,...,...,...,...
177,178,Kamindu Mendis,Sunrisers Hyderabad,"75,00,000","75,00,000",Capped
178,179,Zeeshan Ansari,Sunrisers Hyderabad,"30,00,000","40,00,000",Uncapped
179,180,Sachin Baby,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped
180,181,Aniket Verma,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped
181,182,Atharva Taide,Sunrisers Hyderabad,"30,00,000","30,00,000",Uncapped

loading a huge dataset in chunks

In [ ]:
dfs=pd.read_csv('Sold Player.csv',encoding='ansi',chunksize =50)

In [ ]:
for chunks in dfs:
    print(chunks.shape)

(50, 6)
(50, 6)
(32, 6)